<a href="https://colab.research.google.com/github/joyce-deng-66/CyberThreatHunting/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
import pandas as pd

In [57]:
df = pd.DataFrame([(1, 'Germany'),
                   (2, 'France'),
                   (3, 'Indonesia'),
                   (4, 'France'),
                   (5, 'France'),
                   (6, 'Germany'),
                   (7, 'UK'),          
                   ],
                  columns=['groupid', 'country'],
                  index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])

In [58]:
df

   groupid    country
a        1    Germany
b        2     France
c        3  Indonesia
d        4     France
e        5     France
f        6    Germany
g        7         UK

In [48]:
df.groupby('country').filter(lambda x: len(x) > 2).groupby('country').size().to_frame('count').reset_index()

  country  count
0  France      3

In [49]:
counts = df['country'].value_counts()

In [51]:
counts

France       3
Germany      2
UK           1
Indonesia    1
Name: country, dtype: int64

In [52]:
repl=counts[counts < 2].index
repl

Index(['UK', 'Indonesia'], dtype='object')

In [ ]:
 df[column] = df[column].replace(repl, 'others')

In [64]:
df['country'].value_counts()[df['country'].value_counts()<2].

           temp
UK            1
Indonesia     1

In [66]:
 df['country']=df['country'].replace(df['country'].value_counts()[df['country'].value_counts()<2].index, 'others')

In [67]:
df

   groupid  country
a        1  Germany
b        2   France
c        3   others
d        4   France
e        5   France
f        6  Germany
g        7   others

In [68]:
col_category=['country']
df_dummies = pd.get_dummies(df[col_category], columns=col_category)

In [69]:
df_dummies

   country_France  country_Germany  country_others
a               0                1               0
b               1                0               0
c               0                0               1
d               1                0               0
e               1                0               0
f               0                1               0
g               0                0               1

In [190]:
df['country'].value_counts()>1

France        True
Germany       True
Indonesia    False
UK           False
Name: country, dtype: bool

In [55]:
df.loc[(df['country']=="UK"),['groupid','country']]

   groupid country
g        7      UK

In [63]:
((df['country'].value_counts()>2)=="True").value()

AttributeError: ignored

In [202]:
df['country'].value_counts()[df['country'].value_counts()==1]

Indonesia    1
UK           1
Name: country, dtype: int64

In [208]:
df['country']=="UK"

a    True
b    True
c    True
d    True
e    True
f    True
g    True
Name: country, dtype: bool

In [215]:
t=1;filename="test"+str(t)

In [216]:
filename

'test1'

In [144]:
df['country'].isin(df['country'].value_counts()[df['country'].value_counts()==1].index)
result in:

SyntaxError: ignored

In [80]:
df['country'].value_counts()[df['country'].value_counts()==1].index

Index(['Indonesia', 'UK'], dtype='object')

In [86]:
for i in df.columns:
  print(df[i].isna().count())

7
7

In [104]:
for col in df.columns:
    print(col, " has %d values and %d unique values." % (df[col].count(), len(df[col].unique())))

groupid  has 7 values and 7 unique values.
country  has 7 values and 4 unique values.

In [103]:
df.loc[df['country']=='UK'][['groupid','country']]

   groupid country
g        7      UK

In [113]:
temp=df['groupid'].tolist().dtype(int)

AttributeError: ignored

In [114]:
pd.Series(df['groupid'], dtype='int32')

a    1
b    2
c    3
d    4
e    5
f    6
g    7
Name: groupid, dtype: int32

In [117]:
df_1 = df['groupid'].copy().tolist()
df_1

[1, 2, 3, 4, 5, 6, 7]

In [126]:
df['country'].min()

'France'

In [107]:
dtemp

   groupid    country
a        1    Germany
b        2     France
c        3  Indonesia
d        4     France
e        5     France
f        6    Germany
g        7         UK

In [137]:
temp=[11,12,13,14,15,16,17]

In [138]:
df['col2']=temp

In [139]:
df

   groupid    country  col  col1  col2
a        1    Germany    1     1    11
b        2     France    2     2    12
c        3  Indonesia    3     3    13
d        4     France    4     4    14
e        5     France    5     5    15
f        6    Germany    6     6    16
g        7         UK    7     7    17

In [142]:
df.drop(['col1'], axis=1,inplace=True)

In [143]:
df

   groupid    country  col  col2
a        1    Germany    1    11
b        2     France    2    12
c        3  Indonesia    3    13
d        4     France    4    14
e        5     France    5    15
f        6    Germany    6    16
g        7         UK    7    17

In [220]:
df.agg({'groupid': ['min', 'max', 'mean', 'median']})

        groupid
min         1.0
max         7.0
mean        4.0
median      4.0

In [237]:
df.drop(df[df.country =="France"].index,axis=0, inplace=False)

   groupid    country
a        1    Germany
c        3  Indonesia
f        6    Germany
g        7         UK

In [238]:
df

   groupid    country
a        1    Germany
b        2     France
c        3  Indonesia
d        4     France
e        5     France
f        6    Germany
g        7         UK

In [240]:
DF_dummies

   France  Germany  Indonesia  UK
a       0        1          0   0
b       1        0          0   0
c       0        0          1   0
d       1        0          0   0
e       1        0          0   0
f       0        1          0   0
g       0        0          0   1

In [239]:
DF_dummies = pd.get_dummies(df["country"])

In [241]:
from sklearn.preprocessing import OneHotEncoder

In [242]:
encoder = OneHotEncoder(handle_unknown="ignore")

In [262]:
tem=df["country"].to_frame()

In [266]:
tem.values

array([['Germany'],
       ['France'],
       ['Indonesia'],
       ['France'],
       ['France'],
       ['Germany'],
       ['UK']], dtype=object)

In [267]:
encoder.fit(tem.values)
temp1 = encoder.transform(tem.values)
temp1

<7x4 sparse matrix of type '<class 'numpy.float64'>'
	with 7 stored elements in Compressed Sparse Row format>

In [268]:
print(temp1)

  (0, 1)	1.0
  (1, 0)	1.0
  (2, 2)	1.0
  (3, 0)	1.0
  (4, 0)	1.0
  (5, 1)	1.0
  (6, 3)	1.0

In [257]:
df.groupby('country').size().to_frame('size').reset_index().sort_values(['country', 'size'], ascending=[False, True])

     country  size
3         UK     1
2  Indonesia     1
1    Germany     2
0     France     3

In [274]:
df['country'].value_counts()[df['country'].value_counts()>1]

France     3
Germany    2
Name: country, dtype: int64

In [288]:
df['country'].value_counts().reset_index()

       index  country
0     France        3
1    Germany        2
2  Indonesia        1
3         UK        1

In [295]:
df['country'].value_counts().values

array([3, 2, 1, 1])

In [296]:
df = pd.DataFrame([(1, 'Germany'),
                   (1, 'France'),
                   (3, 'Indonesia'),
                   (4, 'France'),
                   (5, 'France'),
                   (6, 'Germany'),
                   (7, 'UK'),          
                   ],
                  columns=['groupid', 'country'],
                  index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])

SyntaxError: ignored

In [14]:
df_new = pd.DataFrame([("1001", "1/1/2018",  "mobile" , 100),
                   ("1001",  "1/1/2018", "desktop", 100),
                   ("1002",  "1/1/2018",  "mobile",  100),
                   ("1002",  "1/2/2018",  "mobile",  100),
                   ("1003",  "1/1/2018",  "desktop",  100),
                   ("1003",  "1/2/2018",  "desktop",  100)      
                   ],
                  columns=["member_id", "date", "channel", "spend"],
                  index=['a', 'b', 'c', 'd', 'e', 'f'])

In [15]:
df_new

  member_id      date  channel  spend
a      1001  1/1/2018   mobile    100
b      1001  1/1/2018  desktop    100
c      1002  1/1/2018   mobile    100
d      1002  1/2/2018   mobile    100
e      1003  1/1/2018  desktop    100
f      1003  1/2/2018  desktop    100

In [30]:
df_new.assign(date_new=lambda x: pd.to_datetime(x['date'], format='%m/%d/%Y'))

  member_id      date  channel  spend   date_new
a      1001  1/1/2018   mobile    100 2018-01-01
b      1001  1/1/2018  desktop    100 2018-01-01
c      1002  1/1/2018   mobile    100 2018-01-01
d      1002  1/2/2018   mobile    100 2018-01-02
e      1003  1/1/2018  desktop    100 2018-01-01
f      1003  1/2/2018  desktop    100 2018-01-02

In [18]:
df_new

  member_id      date  channel  spend
a      1001  1/1/2018   mobile    100
b      1001  1/1/2018  desktop    100
c      1002  1/1/2018   mobile    100
d      1002  1/2/2018   mobile    100
e      1003  1/1/2018  desktop    100
f      1003  1/2/2018  desktop    100

In [26]:
df_new['channel'].str.upper()

a     MOBILE
b    DESKTOP
c     MOBILE
d     MOBILE
e    DESKTOP
f    DESKTOP
Name: channel, dtype: object

In [29]:
df_new.drop('c: 1002', axis=1)

KeyError: ignored

In [24]:
pd.melt(df_new[["date","channel"]]).query('value == "mobile"')

  variable   value
6  channel  mobile
8  channel  mobile
9  channel  mobile

In [10]:
df_new.groupby(['date','channel']).sum(['spend']). reset_index()

       date  channel  spend
0  1/1/2018  desktop    200
1  1/1/2018   mobile    200
2  1/2/2018  desktop    100
3  1/2/2018   mobile    100

In [8]:
df_new.groupby(['date', 'member_id']).sum(['mobile_spend', 'desktop_spend']).reset_index()

       date member_id  spend
0  1/1/2018      1001    200
1  1/1/2018      1002    100
2  1/1/2018      1003    100
3  1/2/2018      1002    100
4  1/2/2018      1003    100

In [8]:
spending=df_new.copy()

In [12]:
df_new.unique()

AttributeError: ignored

In [9]:
spending['mobile_spend'] = spending[spending.channel == 'mobile'].spend

In [11]:
spending['desktop_spend'] = spending[spending.channel == 'desktop'].spend

In [12]:
 member_spend=spending.groupby(['date', 'member_id']).sum(['mobile_spend', 'desktop_spend']).reset_index()

In [13]:
member_spend

       date member_id  spend  mobile_spend  desktop_spend
0  1/1/2018      1001    200         100.0          100.0
1  1/1/2018      1002    100         100.0            0.0
2  1/1/2018      1003    100           0.0          100.0
3  1/2/2018      1002    100         100.0            0.0
4  1/2/2018      1003    100           0.0          100.0

In [351]:

member_spend[member_spend.mobile_spend>0].assign(channel='mobile')

       date member_id  spend  mobile_spend  desktop_spend channel
0  1/1/2018      1001    200         100.0          100.0  mobile
1  1/1/2018      1002    100         100.0            0.0  mobile
3  1/2/2018      1002    100         100.0            0.0  mobile

In [355]:
filter = (member_spend['mobile_spend']==0) & (member_spend.desktop_spend>0)

In [372]:
member_spend.assign(channel='mobile').where(filter, inplace = False)

       date member_id  spend  mobile_spend  desktop_spend channel
0       NaN       NaN    NaN           NaN            NaN     NaN
1       NaN       NaN    NaN           NaN            NaN     NaN
2  1/1/2018      1003  100.0           0.0          100.0  mobile
3       NaN       NaN    NaN           NaN            NaN     NaN
4  1/2/2018      1003  100.0           0.0          100.0  mobile

In [373]:
member_spend

       date member_id  spend  mobile_spend  desktop_spend
0  1/1/2018      1001    200         100.0          100.0
1  1/1/2018      1002    100         100.0            0.0
2  1/1/2018      1003    100           0.0          100.0
3  1/2/2018      1002    100         100.0            0.0
4  1/2/2018      1003    100           0.0          100.0

In [382]:
member_spend

       date member_id  spend  mobile_spend  desktop_spend
0  1/1/2018      1001    200         100.0          100.0
1  1/1/2018      1002    100         100.0            0.0
2  1/1/2018      1003    100           0.0          100.0
3  1/2/2018      1002    100         100.0            0.0
4  1/2/2018      1003    100           0.0          100.0

In [14]:
conditions = [
    ((member_spend.mobile_spend>0) & (member_spend.desktop_spend==0)),
    ((member_spend.mobile_spend==0)& (member_spend.desktop_spend>0)),
    ((member_spend.mobile_spend>0) & (member_spend.desktop_spend>0))
    ]

In [15]:
values = ['mobile', 'desktop', 'both']

In [18]:
import numpy as np

In [19]:
member_spend['channel'] = np.select(conditions, values)

In [20]:
member_spend

       date member_id  spend  mobile_spend  desktop_spend  channel
0  1/1/2018      1001    200         100.0          100.0     both
1  1/1/2018      1002    100         100.0            0.0   mobile
2  1/1/2018      1003    100           0.0          100.0  desktop
3  1/2/2018      1002    100         100.0            0.0   mobile
4  1/2/2018      1003    100           0.0          100.0  desktop

In [21]:
tot_members=member_spend.groupby(['date', 'channel']).size().to_frame('tot_members').reset_index()

In [22]:
tot_members

       date  channel  tot_members
0  1/1/2018     both            1
1  1/1/2018  desktop            1
2  1/1/2018   mobile            1
3  1/2/2018  desktop            1
4  1/2/2018   mobile            1

In [26]:
member_spend

       date member_id  spend  mobile_spend  desktop_spend  channel
0  1/1/2018      1001    200         100.0          100.0     both
1  1/1/2018      1002    100         100.0            0.0   mobile
2  1/1/2018      1003    100           0.0          100.0  desktop
3  1/2/2018      1002    100         100.0            0.0   mobile
4  1/2/2018      1003    100           0.0          100.0  desktop

In [31]:
 tot_spend=member_spend.groupby(['date', 'channel']).agg({'spend':sum}).reset_index()

In [28]:
tot_spend

       date  channel  spend
0  1/1/2018     both    200
1  1/1/2018  desktop    100
2  1/1/2018   mobile    100
3  1/2/2018  desktop    100
4  1/2/2018   mobile    100

In [40]:
output = pd.concat([tot_members, tot_spend['spend']], axis=1)

In [41]:
output

       date  channel  tot_members  spend
0  1/1/2018     both            1    200
1  1/1/2018  desktop            1    100
2  1/1/2018   mobile            1    100
3  1/2/2018  desktop            1    100
4  1/2/2018   mobile            1    100

In [42]:
output.drop(['spend'], axis=1, inplace=False)

       date  channel  tot_members
0  1/1/2018     both            1
1  1/1/2018  desktop            1
2  1/1/2018   mobile            1
3  1/2/2018  desktop            1
4  1/2/2018   mobile            1

In [36]:
output1 = tot_members.concat(tot_spend['tot_spend'])

AttributeError: ignored